      *================================================================*
       IDENTIFICATION                           DIVISION.
       PROGRAM-ID. COMANDOS_ARITMETICOS.
      *================================================================*

      *================================================================*
       DATA                                     DIVISION.
      *================================================================*
      *----------------------------------------------------------------*
       WORKING-STORAGE                                   SECTION.
      *----------------------------------------------------------------*
       77  WRK-ACUMULADOR    PIC 9(3) VALUE 100.
       77  WRK-ACUMULADOR2   PIC 9(2) VALUE 2.

      *================================================================*
       PROCEDURE                                DIVISION.
      *================================================================*

      * O COMPUTE SUPORTA: + - * ** () = /
           COMPUTE WRK-ACUMULADOR2 = WRK-ACUMULADOR / 2.
           DISPLAY WRK-ACUMULADOR2.

           STOP RUN.
