      *================================================================*
       IDENTIFICATION                          DIVISION.
      *================================================================*
       PROGRAM-ID. OLA-MUNDO.

      *================================================================*
       PROCEDURE                               DIVISION.
      *================================================================*
           DISPLAY "OLA MUNDO".
           STOP RUN.
