      *================================================================*
       IDENTIFICATION                          DIVISION.
      *================================================================*
       PROGRAM-ID. OLA-MUNDO.

      *================================================================*
       DATA                                    DIVISION.
      *================================================================*
      *----------------------------------------------------------------*
       WORKING-STORAGE                                  SECTION.
      *----------------------------------------------------------------*
       77 MUNDO PIC X(9) VALUE "OLA MUNDO".

      *================================================================*
       PROCEDURE                               DIVISION.
      *================================================================*
           DISPLAY MUNDO.
           STOP RUN.
